SWMM_CFD/Case/OpenFOAM/pipe1/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
       volumetricFlowRate constant 0.1;
        //type fixedValue;
       // value uniform (1 0 0);
    }

    walls
    {
        type            noSlip;
    }

   
    outlet
    {
     
        type            zeroGradient;
    }
      
}


// ************************************************************************* //
