SWMM_CFD/Case/OpenFOAM/pipe1/0/p.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
2000
(
3392.42
3392.42
3392.42
3392.42
3392.42
3392.42
3392.42
3392.42
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
3392.42
3798.01
4111.4
4324.77
4432.88
4432.88
4324.77
4111.4
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
3392.42
3798.01
4111.4
4324.77
4432.88
4432.88
4324.77
4111.4
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
800
(
3175.96
2555.52
1872.05
1142.44
384.134
-384.134
-1142.44
-1872.05
...
)
;
    }
}


// ************************************************************************* //
